import React from "react";
import styles from "./Main.module.css";

function Main() {
  return (
    <>
      <div className={styles.main}>
        <div className={styles.content}>
          <div className={styles.title}>
            <span className={styles.line}></span>
            <h2>قوانین مرکز کد</h2>
          </div>
          <div className={styles.container}>
            <h3>نحوه ی سوال پرسیدن</h3>
            <p>
              تمامی سوالات پرسیده شده در مرکز کد میبایست با زبان فارسی باشد.
              سوالات انگلیسی و یا فینگلیش حذف خواهد شد. همچنین سوال مطرح شده
              میبایست واضح و شامل بخشی از کدی که راجع به آن سوال دارید باشد. در
              صورتی که در سوال شما کلمات نامناسب به کار برده شود، سوال شما حذف و
              اکانت شما و اعتبار اکانت شما بدون هیچگونه اخطار قبلی مسدود خواهد
              شد. همچنین مسدودیت اکانت به صورت دائمی و بدون بازگشت میباشد. در
              صورت نیاز شما میتوانید سوال خود را ویرایش نمایید.
            </p>
            <h3>نحوه ی پاسخ به سوالات</h3>
            <p>
              پاسخ شما به سوالات دیگران میبایست با زبان فارسی باشد. پاسخ های
              انگلیسی و یا فینگلیش حذف خواهد شد. در پاسخ به یک سوال ممکن است
              چندین پاسخ درست توسط کاربران داده شود. اما اولین پاسخ درست از نظر
              منتور به عنوان بهترین پاسخ انتخاب میشود و اعتبار فقط به پاسخ با
              علامت بهترین پاسخ، داده خواهد شد. در صورتی که در پاسخ شما کلمات
              نامناسب به کار برده شود، پاسخ شما حذف و اکانت شما و اعتبار اکانت
              شما بدون هیچگونه اخطار قبلی مسدود خواهد شد. همچنین مسدودیت اکانت
              به صورت دائمی و بدون بازگشت میباشد. در صورت نیاز شما میتوانید پاسخ
              خود را ویرایش نمایید.
            </p>
            <h3>تخلفات احتمالی</h3>
            <p>
              در صورتی که کاربر به هر نحوی در روند پرتال مرکز کد اخلالی ایجاد
              کند، مرکز کد حق مسدود سازی اکانت و اعتبار کاربر را بدون اطلاع قبلی
              برای خود محفوظ میدارد
            </p>
            <h3>حفظ حریم شخصی</h3>
            <p>
              مرکز کد تعهد دارد اطلاعات شخصی کاربران را به هیچ وبسایت، شرکت و یا
              ارگانی به فروش نرساند و هیچ شخص، شرکت و یا ارگانی به اطلاعات شخصی
              شما دسترسی نخواهد داشت مگر با دستور رسمی قوه ی محترم قضایی
            </p>
          </div>
        </div>
      </div>
    </>
  );
}

export default Main;
